Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeSlopeError Property
 The connected fitting(s) cannot successfully change to the new slope value. You may try to disconnect the connections on the fitting(s) and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartCannotChangeSlopeError { get; }
Public Shared ReadOnly Property FabricationPartCannotChangeSlopeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartCannotChangeSlopeError {
	FailureDefinitionId^ get ();
}
static member FabricationPartCannotChangeSlopeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace